app/Models/Pack.php

select COUNT(cp.pack_id) as total, `cat`.`category` from `category_pack` as `cp` inner join `categories` as `cat` on `cp`.`category_id` = `cat`.`id` group by `cat`.`category`
---
    public static function getPacksByCategory()
    {
        return DB::table('category_pack as cp')
            ->join('categories as cat', 'cp.category_id', '=', 'cat.id')
            ->select( DB::raw("COUNT(cp.pack_id) as total"), 'cat.category')
            ->groupBy('cat.category')
            ->get();