app/Models/Shop.php

select `packs`.`id`, `packs`.`title`, `packs`.`price`, `packs`.`sale_price`, `packs`.`picture`, `cat`.`category` from `packs` inner join `category_pack` as `cp` on `cp`.`pack_id` = `packs`.`id` inner join `categories` as `cat` on `cat`.`id` = `cp`.`category_id` where `cat`.`category` in ('Bread & pastries', 'Meals') limit 9 offset 0
select count(*) as aggregate from `packs` inner join `category_pack` as `cp` on `cp`.`pack_id` = `packs`.`id` inner join `categories` as `cat` on `cat`.`id` = `cp`.`category_id` where `cat`.`category` in ('Bread & pastries', 'Meals')
---
    public static function searchShop(Request $request, string $searchCriteria = null, bool $sortBy = false)
    {

        if ($sortBy) {
            $query = DB::table('packs')
                ->select('packs.id', 'packs.title', 'packs.price', 'packs.sale_price', 'packs.picture');

            $query = self::sortShop($query, $request->sortBy);
            return $query->paginate(9);
        }

        if ($searchCriteria === "title" && !empty($request->search)) {
            return DB::table('packs as p')->select('*')
                ->join('stores as s', 'p.store_id','=','s.id')
                ->where('title', 'LIKE', "%{$request->search}%")
                ->orWhere('s.city', 'LIKE', "%{$request->search}%")
                ->paginate(9);
            /*
            return Pack::where('title', 'LIKE', "%{$request->search}%")->paginate(9);*/
        }

        if ($searchCriteria === "category") {
            $checkbox = $request->categories;

            //Check if All exists
            if (in_array("All", $checkbox)) {
                return Pack::paginate(9);
            } else {
                return DB::table('packs')
                    ->select('packs.id', 'packs.title', 'packs.price', 'packs.sale_price', 'packs.picture', 'cat.category')
                    ->join('category_pack as cp', 'cp.pack_id', '=', 'packs.id')
                    ->join('categories as cat', 'cat.id', '=', 'cp.category_id')
                    ->whereIn('cat.category', $checkbox)
                    ->paginate(9);